<?php

if (!function_exists('parseUtf8')) {
    function parseUtf8($input_string)
    {
        if ($input_string === null) {
            return null;
        }

        $trans = [
            'á' => 'a', 'à' => 'a', 'â' => 'a', 'ä' => 'a', 'ã' => 'a', 'å' => 'a',
            'ç' => 'c',
            'é' => 'e', 'è' => 'e', 'ê' => 'e', 'ë' => 'e',
            'í' => 'i', 'ì' => 'i', 'î' => 'i', 'ï' => 'i',
            'ñ' => 'n',
            'ó' => 'o', 'ò' => 'o', 'ô' => 'o', 'ö' => 'o', 'õ' => 'o',
            'ú' => 'u', 'ù' => 'u', 'û' => 'u', 'ü' => 'u',
            'ý' => 'y', 'ÿ' => 'y',
            '!' => '', '@' => '', '#' => '', '$' => '', '%' => '', '^' => '',
            '&' => '', '*' => '', '(' => '', ')' => '', '_' => '', '+' => '',
            '{' => '', '}' => '', '[' => '', ']' => '', '|' => '', ';' => '',
            ':' => '', '"' => '', '-' => '', '<' => '', '>' => '', ',' => '',
            '.' => '', '?' => '', '/' => ''
        ];

        $output_string = strtr($input_string, $trans);

        return strtoupper(trim(str_replace(' ', '', $output_string)));
    }
}
